interThermalPhaseFoam/tutorials/NusseltWavy/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices        
(
//First Block
	//Back face
	(0          0          0)           //00
	(0.0010     0          0)           //01
	(0.0010     0.008      0)           //02
	(0          0.008      0)           //03
	//Front face
	(0         0          0.00005)      //04
	(0.0010    0          0.00005)      //05
	(0.0010    0.008      0.00005)      //06
	(0         0.008      0.00005)      //07
);

blocks          
(
	hex ( 0  1  2  3  4  5  6  7) (100 400 1) simpleGrading (5 1 1)	//00
);

edges           
(
);

boundary         
(
	Inlet
	{
		type            cyclic;
                neighbourPatch  BotOutlet;
		faces
		(
			( 2  3  7  6)
		);
	}

	BotOutlet
	{
		type            cyclic;
                neighbourPatch  Inlet;
		faces
		(
			( 0  1  5  4)
		);
	}

	FreeStream
	{
		type     patch;
		faces
		(
			(1 2 6 5)
		);
	}

	FrontNBack
	{
		type     empty;
		faces		
		(
			( 0  3  2  1)
			( 4  5  6  7)
 
		);
	}

	LeftSide
	{
		type     wall;
		faces
		(
			( 0  4  7  3)
		);
	}

);

mergePatchPairs 
();

// ************************************************************************* //
