interThermalPhaseFoam/tutorials/NusseltWavy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       79500;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  BotOutlet;
    }
    BotOutlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          100;
        startFace       79600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  Inlet;
    }
    FreeStream
    {
        type            patch;
        nFaces          400;
        startFace       79700;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80100;
    }
    LeftSide
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       160100;
    }
)

// ************************************************************************* //
