interThermalPhaseFoam/tutorials/NusseltWavy/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedJump;
        patchType       cyclic;
        jump            uniform 0.71574;//rho_g*g*h 
    }    

    BotOutlet
    {
		type            fixedJump;
        patchType       cyclic;
        jump            uniform 0.71574;//rho_g*g*h 
    }  

    FreeStream
    {
		type            zeroGradient;
        value           uniform 0;
    }

    FrontNBack
    {
        type            empty;
    }

    LeftSide
    {
 		type            zeroGradient;
    }


}


// ************************************************************************* //
