interThermalPhaseFoam/tutorials/NusseltWavy/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type		cyclic;
    }

    BotOutlet
    {
		type		cyclic;
    }

    FreeStream
    {
        type            zeroGradient;
    }

    FrontNBack
    {
        type            empty;
    }

    LeftSide
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
