interThermalPhaseFoam/tutorials/NusseltWavy/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    Inlet
    {
        type            cyclic;
    }
    BotOutlet
    {
        type            cyclic;
    }
    FreeStream
    {
        type            zeroGradient;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            constantAlphaContactAngle;
        gradient        uniform 0;
        limit           gradient;
        theta0          20;
        value           uniform 1;
    }
}


// ************************************************************************* //
